## 🧾 Terraform Plan for `sec_waf_shield`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.waf_shield_advanced.aws_shield_protection.this[0] will be created
  + resource "aws_shield_protection" "this" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "bluebit-advanced-waf-shield"
      + resource_arn = "arn:aws:elasticloadbalancing:us-east-1:123456789012:loadbalancer/app/advanced-app/50dc6c495c0c9188"
      + tags         = {
          + "Environment" = "production"
          + "Owner"       = "security-team"
          + "Project"     = "bluebit"
        }
      + tags_all     = {
          + "Environment" = "production"
          + "Owner"       = "security-team"
          + "Project"     = "bluebit"
        }
    }

  # module.waf_shield_advanced.aws_shield_protection_group.group[0] will be created
  + resource "aws_shield_protection_group" "group" {
      + aggregation          = "SUM"
      + id                   = (known after apply)
      + members              = [
          + "arn:aws:elasticloadbalancing:us-east-1:123456789012:loadbalancer/app/app1/50dc6c495c0c9188",
          + "arn:aws:elasticloadbalancing:us-east-1:123456789012:loadbalancer/app/app2/60ec7c395d1d9289",
        ]
      + pattern              = "ARBITRARY"
      + protection_group_arn = (known after apply)
      + protection_group_id  = "bluebit-critical-apps"
      + tags_all             = (known after apply)
    }

  # module.waf_shield_advanced.aws_wafv2_web_acl.this will be created
  + resource "aws_wafv2_web_acl" "this" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "WAF ACL for application-layer protection"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "bluebit-advanced-waf"
      + scope       = "REGIONAL"
      + tags        = {
          + "Environment" = "production"
          + "Owner"       = "security-team"
          + "Project"     = "bluebit"
        }
      + tags_all    = {
          + "Environment" = "production"
          + "Owner"       = "security-team"
          + "Project"     = "bluebit"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "AWS-AWSManagedRulesCommonRuleSet"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "CommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "bluebit-advanced-waf"
          + sampled_requests_enabled   = true
        }
    }

  # module.waf_shield_advanced.aws_wafv2_web_acl_association.this[0] will be created
  + resource "aws_wafv2_web_acl_association" "this" {
      + id           = (known after apply)
      + resource_arn = "arn:aws:elasticloadbalancing:us-east-1:123456789012:loadbalancer/app/advanced-app/50dc6c495c0c9188"
      + web_acl_arn  = (known after apply)
    }

  # module.waf_shield_basic.aws_wafv2_web_acl.this will be created
  + resource "aws_wafv2_web_acl" "this" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "WAF ACL for application-layer protection"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "bluebit-basic-waf"
      + scope       = "REGIONAL"
      + tags_all    = (known after apply)

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "AWS-AWSManagedRulesCommonRuleSet"
          + priority = 1

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "CommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "bluebit-basic-waf"
          + sampled_requests_enabled   = true
        }
    }

  # module.waf_shield_basic.aws_wafv2_web_acl_association.this[0] will be created
  + resource "aws_wafv2_web_acl_association" "this" {
      + id           = (known after apply)
      + resource_arn = "arn:aws:elasticloadbalancing:us-east-1:123456789012:loadbalancer/app/my-app/50dc6c495c0c9188"
      + web_acl_arn  = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->